#pragma once
#include"Point.h"
#include<iostream>
#include <iomanip>
#include<Windows.h>
#include<ctime>
#include<cstring>
#include<fstream>
using namespace std;

//Разработать класс Rectangle(прямоугольник) со сторонами параллельными осям координат.
//Поля класса должны быть объектами класса Point(точка).
//Класс должен содержать : конструктор по умолчанию, конструктор с параметрами,
//при необходимости реализовать деструктор и конструктор копирования.
//Добавить методы для :
//□	перемещения прямоугольника вдоль осей
//□	изменения размера прямоугольника
//□	определения площади, периметра прямоугольника
//□	метод для проверки на равенство  двух прямоугольников
//□	вывод на экран информации об объекте
//□	для копирования объектов
//□	остальные методы на усмотрение разработчика(методы set и get)
//Написать интерфейс для работы с классом.
//Реализовать динамический массив объектов класса с возможностью добавления, удаления объектов из массива.
//Реализовать возможность записи информации об объектах массива в текстовый файл, бинарный файл.
